app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations"
---
  def index
    redirect_guests #use this to ensure only logged in users can view the website
    @locations = Location.all

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def find_users
    redirect_guests
    loc = Location.find(params[:id])