app/controllers/users_controller.rb

  def create
    user_hash = params[:user]
    if user_hash[:password] != user_hash[:password_confirmation]
      flash[:notice]= "Password confirmation and password did not match"
      redirect_to signup_path and return
    end
    @user = User.new(:name => user_hash[:name], :email => user_hash[:email], :password => user_hash[:password])
    @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)

  def check_in
    redirect_guests
    loc_id = params[:location_id]
    already_checked = current_user.checkin

    if already_checked == nil
      Checkin.create(:user_id => current_user.id, :location_id => loc_id)
    else
      already_checked.update_attributes(:location_id => loc_id)
---
INSERT INTO "checkins" ("created_at", "location_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 12 Oct 2012 02:45:01 UTC +00:00], ["location_id", 3], ["updated_at", Fri, 12 Oct 2012 02:45:01 UTC +00:00], ["user_id", 6]]
UPDATE "checkins" SET "location_id" = 3, "updated_at" = '2012-10-12 01:39:58.822866' WHERE "checkins"."id" = 6

  def check_out
    checked = current_user.checkin
    if checked
      Checkin.destroy_all(:id => checked.id)
---
DELETE FROM "checkins" WHERE "checkins"."id" = ?  [["id", 6]]